In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 ={
    "name":['harry','siddu','mallu','nagu'],
    "marks":[92,13,15,18],
    "city": ['bang','ukd','kolkata','ranebennur']
}

In [3]:
dict1

{'name': ['harry', 'siddu', 'mallu', 'nagu'],
 'marks': [92, 13, 15, 18],
 'city': ['bang', 'ukd', 'kolkata', 'ranebennur']}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  marks        city
0  harry     92        bang
1  siddu     13         ukd
2  mallu     15     kolkata
3   nagu     18  ranebennur

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends1.csv', index=False)

In [8]:
df.head(2)

    name  marks  city
0  harry     92  bang
1  siddu     13   ukd

In [9]:
df.tail(2)

    name  marks        city
2  mallu     15     kolkata
3   nagu     18  ranebennur

In [10]:
df.describe()

           marks
count   4.000000
mean   34.500000
std    38.388366
min    13.000000
25%    14.500000
50%    16.500000
75%    36.500000
max    92.000000

In [11]:
df1 =pd.read_csv('housing.csv')

In [12]:
df1

,Unnamed: 0,price,lotsize,bedrooms,bathrms,stories,driveway,recroom,fullbase,gashw,airco,garagepl,prefarea
0,1,42000.0,5850,3,1,2,yes,no,yes,no,no,1,no
1,2,38500.0,4000,2,1,1,yes,no,no,no,no,0,no
2,3,49500.0,3060,3,1,1,yes,no,no,no,no,0,no
3,4,60500.0,6650,3,1,2,yes,yes,no,no,no,0,no
4,5,61000.0,6360,2,1,1,yes,no,no,no,no,0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541,542,91500.0,4800,3,2,4,yes,yes,no,no,yes,0,no
542,543,94000.0,6000,3,2,4,yes,no,no,no,yes,0,no
543,544,103000.0,6000,3,2,4,yes,yes,no,no,yes,1,no
544,545,105000.0,6000,3,2,2,yes,yes,no,no,yes,1,no
545,546,105000.0,6000,3,1,2,yes,no,no,no,yes,1,no

In [13]:
df1["price"][0]

42000.0

In [14]:
df.index=['first','second','third','fourth']

In [15]:
df

         name  marks        city
first   harry     92        bang
second  siddu     13         ukd
third   mallu     15     kolkata
fourth   nagu     18  ranebennur

In [16]:
ser= pd.Series(np.random.rand(34))

In [17]:
type(ser)

pandas.core.series.Series

In [18]:
newdf = pd.DataFrame(np.random.rand(334,5) ,  index=np.arange(334))

In [19]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.549458  0.574043  0.106320  0.509728  0.169962
1  0.269239  0.762450  0.128035  0.990498  0.333555
2  0.994008  0.754798  0.442994  0.640687  0.631210
3  0.422978  0.143340  0.919965  0.296447  0.359804
4  0.559401  0.631973  0.326173  0.379839  0.633844

In [20]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495428    0.496081    0.500047    0.508770    0.496218
std      0.296100    0.288668    0.286340    0.281645    0.292030
min      0.002713    0.005507    0.004487    0.000214    0.003649
25%      0.229056    0.239515    0.258810    0.290194    0.253584
50%      0.485354    0.503266    0.505942    0.509574    0.505977
75%      0.757966    0.738063    0.751844    0.747621    0.751554
max      0.999745    0.999895    0.998930    0.993278    0.999817

In [21]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
newdf[0][0]="siddu"

In [23]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
newdf.head()

          0         1         2         3         4
0     siddu  0.574043  0.106320  0.509728  0.169962
1  0.269239  0.762450  0.128035  0.990498  0.333555
2  0.994008  0.754798  0.442994  0.640687  0.631210
3  0.422978  0.143340  0.919965  0.296447  0.359804
4  0.559401  0.631973  0.326173  0.379839  0.633844

In [25]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [26]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [27]:
newdf.to_numpy()

array([['siddu', 0.5740433490667526, 0.1063204976158535,
        0.509727616571688, 0.16996167861559686],
       [0.26923941649308614, 0.7624503589750475, 0.12803531827276105,
        0.9904982216792839, 0.3335550908530891],
       [0.9940084462979868, 0.7547976353887771, 0.4429938831513741,
        0.6406869535501908, 0.6312096953921249],
       ...,
       [0.35043607762558737, 0.7517437396379136, 0.08344823624912778,
        0.9535865555246484, 0.1657956010468311],
       [0.7602030696986392, 0.238890895928633, 0.54346399576469,
        0.25185707998539286, 0.8680506929244257],
       [0.8699742998742358, 0.3407791498064521, 0.4049246593379512,
        0.62808208324479, 0.23606203673282922]], dtype=object)

In [28]:
newdf[0][0]=0.34566

In [29]:
newdf.head()

          0         1         2         3         4
0   0.34566  0.574043  0.106320  0.509728  0.169962
1  0.269239  0.762450  0.128035  0.990498  0.333555
2  0.994008  0.754798  0.442994  0.640687  0.631210
3  0.422978  0.143340  0.919965  0.296447  0.359804
4  0.559401  0.631973  0.326173  0.379839  0.633844

In [30]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34566,0.269239,0.994008,0.422978,0.559401,0.643489,0.011947,0.086966,0.625101,0.792988,...,0.989574,0.207423,0.338272,0.825141,0.207866,0.235456,0.301745,0.350436,0.760203,0.869974
1,0.574043,0.76245,0.754798,0.14334,0.631973,0.888243,0.340331,0.352504,0.22871,0.282478,...,0.107943,0.37046,0.502406,0.22745,0.316384,0.128413,0.429724,0.751744,0.238891,0.340779
2,0.10632,0.128035,0.442994,0.919965,0.326173,0.471375,0.498796,0.544865,0.943678,0.051304,...,0.540665,0.390884,0.517325,0.6479,0.901593,0.142624,0.447939,0.083448,0.543464,0.404925
3,0.509728,0.990498,0.640687,0.296447,0.379839,0.484032,0.557591,0.243946,0.530784,0.016698,...,0.450352,0.224046,0.950989,0.350282,0.749494,0.111231,0.634051,0.953587,0.251857,0.628082
4,0.169962,0.333555,0.63121,0.359804,0.633844,0.983441,0.279829,0.540315,0.791734,0.549119,...,0.87823,0.25308,0.230885,0.565828,0.325583,0.080775,0.122849,0.165796,0.868051,0.236062

In [32]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.169962  0.509728  0.106320  0.574043   0.34566
1    0.333555  0.990498  0.128035  0.762450  0.269239
2    0.631210  0.640687  0.442994  0.754798  0.994008
3    0.359804  0.296447  0.919965  0.143340  0.422978
4    0.633844  0.379839  0.326173  0.631973  0.559401
..        ...       ...       ...       ...       ...
329  0.080775  0.111231  0.142624  0.128413  0.235456
330  0.122849  0.634051  0.447939  0.429724  0.301745
331  0.165796  0.953587  0.083448  0.751744  0.350436
332  0.868051  0.251857  0.543464  0.238891  0.760203
333  0.236062  0.628082  0.404925  0.340779  0.869974

[334 rows x 5 columns]

In [33]:
type(newdf[0])

pandas.core.series.Series

In [34]:
newdf.head()

          0         1         2         3         4
0   0.34566  0.574043  0.106320  0.509728  0.169962
1  0.269239  0.762450  0.128035  0.990498  0.333555
2  0.994008  0.754798  0.442994  0.640687  0.631210
3  0.422978  0.143340  0.919965  0.296447  0.359804
4  0.559401  0.631973  0.326173  0.379839  0.633844

In [35]:
newdf2=newdf.copy()

In [36]:
newdf[0][0]=0.348778

C:\Users\siddappa\AppData\Local\Temp\ipykernel_7024\2021170525.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0]=0.348778

In [37]:
newdf2[0][0]=4576

C:\Users\siddappa\AppData\Local\Temp\ipykernel_7024\250320429.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=4576

In [38]:
newdf

            0         1         2         3         4
0    0.348778  0.574043  0.106320  0.509728  0.169962
1    0.269239  0.762450  0.128035  0.990498  0.333555
2    0.994008  0.754798  0.442994  0.640687  0.631210
3    0.422978  0.143340  0.919965  0.296447  0.359804
4    0.559401  0.631973  0.326173  0.379839  0.633844
..        ...       ...       ...       ...       ...
329  0.235456  0.128413  0.142624  0.111231  0.080775
330  0.301745  0.429724  0.447939  0.634051  0.122849
331  0.350436  0.751744  0.083448  0.953587  0.165796
332  0.760203  0.238891  0.543464  0.251857  0.868051
333  0.869974  0.340779  0.404925  0.628082  0.236062

[334 rows x 5 columns]

In [39]:
newdf2

            0         1         2         3         4
0        4576  0.574043  0.106320  0.509728  0.169962
1    0.269239  0.762450  0.128035  0.990498  0.333555
2    0.994008  0.754798  0.442994  0.640687  0.631210
3    0.422978  0.143340  0.919965  0.296447  0.359804
4    0.559401  0.631973  0.326173  0.379839  0.633844
..        ...       ...       ...       ...       ...
329  0.235456  0.128413  0.142624  0.111231  0.080775
330  0.301745  0.429724  0.447939  0.634051  0.122849
331  0.350436  0.751744  0.083448  0.953587  0.165796
332  0.760203  0.238891  0.543464  0.251857  0.868051
333  0.869974  0.340779  0.404925  0.628082  0.236062

[334 rows x 5 columns]

In [40]:
df.shape

(4, 3)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, first to fourth
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [51]:
# df.mean()
df.describe()

           marks
count   4.000000
mean   34.500000
std    38.388366
min    13.000000
25%    14.500000
50%    16.500000
75%    36.500000
max    92.000000

In [52]:
df.corr()

       marks
marks    1.0

In [53]:
df.max()

name     siddu
marks       92
city       ukd
dtype: object

In [54]:
df.count()

name     4
marks    4
city     4
dtype: int64

In [55]:
df.min()

name     harry
marks       13
city      bang
dtype: object

In [60]:
newdf.median()

0    0.479838
1    0.503266
2    0.505942
3    0.509574
4    0.505977
dtype: float64